<script type="text/javascript">
// Создаем новый объект связанных списков
var syncList1 = new syncList;

// Определяем значения подчиненных списков (2 и 3 селектов)
syncList1.dataList = {

/* Определяем элементы второго списка в зависимости
от выбранного значения в первом списке */

  'Історичний':{
  		'0101-istor':'0101. Педагогічна освіта'
 },

  'Природничий':{
      	'0101-pryrod':'0101. Педагогічна освіта'
  },

  'ННІ Іноземної філології':{
      	'0101-inyaz':'0101. Педагогічна освіта'
  },

  'ННІ Педагогіки':{
  		'0101-pedfak':'0101. Педагогічна освіта'
  },

  'ННІ Філології та журналістики':{
      	'0101-filfak':'0101. Педагогічна освіта'
 },

  'Соціально психологічний':{
  		'0101-socpsyh':'0101. Педагогічна освіта',
      	'0401-socpsyh':'0401. Психологія'
 },

  'Фізико-математичний':{
      	'0101-fizmat':'0101. Педагогічна освіта',
      	'0802-fizmat':'0802. Прикладна математика'
  },

  'Фізичного виховання та спорту':{
      	'0101-fizkult':'0101. Педагогічна освіта',
      	'0102-fizkult':'0102. Фізичне виховання і спорт'
  },

/*Определяем элементы третьего списка в зависимости
от выбранного значения во втором списке */

  '0101-istor':{
  		'8.010103 ПМСО. Історія':'8.010103 ПМСО. Історія'
  },

  '0101-pryrod':{
      	'8.010103 ПМСО. Біологія':'8.010103 ПМСО. Біологія',
      	'8.010103 ПМСО. Хімія':'8.010103 ПМСО. Хімія'
  },

  '0101-inyaz':{
      	'8.010103 ПМСО. Мова та література (англійська)':'8.010103 ПМСО. Мова та література (англійська)',
      	'8.010103 ПМСО. Мова та література (німецька)':'8.010103 ПМСО. Мова та література (німецька)'
  },

  '0101-pedfak':{
  		'8.010102 Початкове навчання':'8.010102 Початкове навчання',
  },

  '0101-filfak':{
  		'8.010103 ПМСО. Мова та література (російська)':'8.010103 ПМСО. Мова та література (російська)',
  		'8.010103 ПМСО. Українська мова та література':'8.010103 ПМСО. Українська мова та література'
  },

  '0401-socpsyh':{
  		'8.040101 Психологія':'8.040101 Психологія'
  },

  '0101-socpsyh':{
  		'8.010105 Соціальна педагогіка':'8.010105 Соціальна педагогіка'
  },

  '0101-fizmat':{
  		'8.010103 ПМСО. Математика':'8.010103 ПМСО. Математика',
  		'8.010103 ПМСО. Фізика':'8.010103 ПМСО. Фізика'
  },

  '0802-fizmat':{
  		'8.080201 Інформатика':'8.080201 Інформатика'
  },

  '0101-fizkult':{
  	'8.010103 ПМСО. Фізична культура':'8.010103 ПМСО. Фізична культура'
  },

  '0102-fizkult':{
  	'8.010201 Фізичне виховання':'8.010201 Фізичне виховання'
  },
};

// Включаем синхронизацию связанных списков
syncList1.sync("faculty","training","speciality");
</script>