<script type="text/javascript">
// Создаем новый объект связанных списков
var syncList1 = new syncList;

// Определяем значения подчиненных списков (2 и 3 селектов)
syncList1.dataList = {

/* Определяем элементы второго списка в зависимости
от выбранного значения в первом списке */

  'Історичний':{
  		'0101-istor':'0101. Педагогічна освіта'
 },

  'Природничий':{
      	'0101-pryrod':'0101. Педагогічна освіта'
  },

  'ННІ Іноземної філології':{
      	'0101-inyaz':'0101. Педагогічна освіта',
      	'0305-inyaz':'0305. Філологія'
  },

  'ННІ Педагогіки':{
  		'0101-pedfak':'0101. Педагогічна освіта',
      	'0202-pedfak':'0202. Мистецтво'
  },

  'ННІ Філології та журналістики':{
      	'0101-filfak':'0101. Педагогічна освіта',
      	'0302-filfak':'0302. Журналістика'
 },

  'Соціально психологічний':{
  		'0101-socpsyh':'0101. Педагогічна освіта',
      	'0401-socpsyh':'0401. Психологія',
      	'0502-socpsyh':'0502. Менеджмент'
 },

  'Фізико-математичний':{
      	'0101-fizmat':'0101. Педагогічна освіта',
      	'0802-fizmat':'0802. Прикладна математика'
  },

  'Фізичного виховання та спорту':{
      	'0101-fizkult':'0101. Педагогічна освіта'
  },

/*Определяем элементы третьего списка в зависимости
от выбранного значения во втором списке */

  '0101-istor':{
  		'7.010103 ПМСО. Історія':'7.010103 ПМСО. Історія'
  },

  '0101-pryrod':{
      	'7.010103 ПМСО. Біологія':'7.010103 ПМСО. Біологія',
      	'7.010103 ПМСО. Хімія':'7.010103 ПМСО. Хімія'
  },

  '0101-inyaz':{
      	'7.010103 ПМСО. Мова та література (англійська)':'7.010103 ПМСО. Мова та література (англійська)',
      	'7.010103 ПМСО. Мова та література (німецька)':'7.010103 ПМСО. Мова та література (німецька)'
  },

  '0305-inyaz':{
  		'7.030507 Переклад':'7.030507 Переклад'
  },

  '0202-pedfak':{
  		'7.020207 Музична педагогіка і виховання':'7.020207 Музична педагогіка і виховання'
  },

  '0101-pedfak':{
  		'7.010101 Дошкільне виховання':'7.010101 Дошкільне виховання',
  		'7.010102 Початкове навчання':'7.010102 Початкове навчання'
  },

  '0101-filfak':{
  		'7.010103 ПМСО. Мова та література (російська)':'7.010103 ПМСО. Мова та література (російська)',
  		'7.010103 ПМСО. Українська мова та література':'7.010103 ПМСО. Українська мова та література'
  },

  '0302-filfak':{
  		'7.030203 Видавнича справа та редагування':'7.030203 Видавнича справа та редагування'
  },

  '0502-socpsyh':{
  		'7.050201 Менеджмент організацій':'7.050201 Менеджмент організацій'
  },

  '0401-socpsyh':{
  		'7.040101 Психологія':'7.040101 Психологія'
  },

  '0101-socpsyh':{
  		'7.010107 Практична психологія':'7.010107 Практична психологія',
  		'7.010105 Соціальна педагогіка':'7.010105 Соціальна педагогіка'
  },

  '0101-fizmat':{
  		'7.010103 ПМСО. Математика':'7.010103 ПМСО. Математика',
  		'7.010103 ПМСО. Фізика':'7.010103 ПМСО. Фізика'
  },

  '0802-fizmat':{
  		'7.080201 Інформатика':'7.080201 Інформатика'
  },

  '0101-fizkult':{
		'7.010103 ПМСО. Фізична культура':'7.010103 ПМСО. Фізична культура'
  },

  /*Определяем элементы четвертого списка в зависимости
от выбранного значения в третьем списке */

  '7.010103 ПМСО. Історія':{
  		'7.010103 ПМСО. Історія. Спеціалізація: правознавство':'7.010103 ПМСО. Історія. Спеціалізація: правознавство',
  		'7.010103 ПМСО. Історія. Спеціалізація: методика виховної роботи ':'7.010103 ПМСО. Історія. Спеціалізація: методика виховної роботи ',
  		'7.010103 ПМСО. Історія та українська мова і література':'7.010103 ПМСО. Історія та українська мова і література'
},

  '7.010103 ПМСО. Біологія':{
      	'7.010103 ПМСО. Біологія':'7.010103 ПМСО. Біологія',
		'7.010103 ПМСО. Біологія і хімія':'7.010103 ПМСО. Біологія і хімія',
		'7.010103 ПМСО. Біологія. 7.040101 Психологія. Спеціалізація: практична психологія':'7.010103 ПМСО. Біологія. 7.040101 Психологія. Спеціалізація: практична психологія',
		'7.010103 ПМСО. Біологія. Спеціалізація: географія і краєзнавчо-туристична робота':'7.010103 ПМСО. Біологія. Спеціалізація: географія і краєзнавчо-туристична робота'
  },

  '7.010103 ПМСО. Хімія':{
      	'7.010103 ПМСО. Хімія і біологія':'7.010103 ПМСО. Хімія і біологія'

  },

  '7.010103 ПМСО. Мова та література (англійська)':{
      	'7.010103 ПМСО. Мова та література (англійська, німецька)':'7.010103 ПМСО. Мова та література (англійська, німецька)',
      	'7.010103 ПМСО. Мова та література (англійська). 7.010105 Соціальна педагогіка. Спеціалізація: соціально-педагогічна робота з сім’єю.':'7.010103 ПМСО. Мова та література (англійська). 7.010105 Соціальна педагогіка. Спеціалізація: соціально-педагогічна робота з сім’єю',
		'7.010103 ПМСО. Мова та література (англійська). Спеціалізація: польська мова':'7.010103 ПМСО. Мова та література (англійська). Спеціалізація: польська мова'
   },

  '7.010103 ПМСО. Мова та література (німецька)':{
      	'7.010103 ПМСО. Мова та література (німецька, англійська)':'7.010103 ПМСО. Мова та література (німецька, англійська)',
		'7.010103 ПМСО. Мова та література (німецька). 7.010105 Соціальна педагогіка. Спеціалізація: соціально-педагогічна робота з сім’єю.':'7.010103 ПМСО. Мова та література (німецька). 7.010105 Соціальна педагогіка. Спеціалізація: соціально-педагогічна робота з сім’єю',
  },

  '7.030507 Переклад':{
      	'7.030507 Переклад':'7.030507 Переклад'
		},

  '7.020207 Музична педагогіка і виховання':{
      	'7.020207 Музична педагогіка і виховання. Спеціалізація: художня культура':'7.020207 Музична педагогіка і виховання. Спеціалізація: художня культура',
		'7.020207 Музична педагогіка і виховання (після скороченого терміну)':'7.020207 Музична педагогіка і виховання (після скороченого терміну)'
		},

	'7.010101 Дошкільне виховання':{
      	'7.010101 Дошкільне виховання (після скороченого терміну)':'7.010101 Дошкільне виховання (після скороченого терміну)'
		},

	'7.010102 Початкове навчання':{
      	'7.010102 Початкове навчання. Спеціалізація: мова та література (англійська)':'7.010102 Початкове навчання. Спеціалізація: мова та література (англійська)',
		'7.010102 Початкове навчання. Спеціалізація: образотворче мистецтво':'7.010102 Початкове навчання. Спеціалізація: образотворче мистецтво',
		'7.010102 Початкове навчання. Спеціалізація: музика':'7.010102 Початкове навчання. Спеціалізація: музика',
		'7.010102 Початкове навчання. 7.010103 Педагогіка і методика середньої освіти. Хореографія':'7.010102 Початкове навчання. 7.010103 Педагогіка і методика середньої освіти. Хореографія',
		'7.010102 Початкове навчання. 7.040101 Психологія. Спеціалізація: практична психологія':'7.010102 Початкове навчання. 7.040101 Психологія. Спеціалізація: практична психологія',
		'7.010102 Початкове навчання (після скороченого терміну)':'7.010102 Початкове навчання (після скороченого терміну)'
		},

	'7.010103 ПМСО. Мова та література (російська)':{
      	'7.010103 ПМСО. Мова та література (російська, англійська)':'7.010103 ПМСО. Мова та література (російська, англійська)',
		'7.010103 ПМСО. Мова та література (російська, німецька)':'7.010103 ПМСО. Мова та література (російська, німецька)'
		},

	'7.010103 ПМСО. Українська мова та література':{
		'7.010103 ПМСО. Українська мова та література':'7. 010103 ПМСО. Українська мова та література',
		'7.010103 ПМСО. Українська мова та література (після скороченого терміну)':'7. 010103 ПМСО. Українська мова та література (після скороченого терміну)',
		'7.010103 ПМСО. Українська мова і література. 7.010105 Соціальна педагогіка. Cпеціалізація: соціально-педагогічна робота з сім`єю':'7.010103 ПМСО. Українська мова і література. 7.010105 Соціальна педагогіка. Cпеціалізація: соціально-педагогічна робота з сім`єю',
		'7.010103 ПМСО. Українська мова і література. 7.040101 Психологія. Спеціалізація: практична психологія':'7.010103 ПМСО. Українська мова і література. 7.040101 Психологія. Спеціалізація: практична психологія',
		'7.010103 ПМСО. Українська мова і література та мова і література (англійська)':'7.010103 ПМСО. Українська мова і література та мова і література (англійська)',
		'7.010103 ПМСО. Українська мова і література та мова і література (німецька)':'7.010103 ПМСО. Українська мова і література та мова і література (німецька)',
		'7.010103 ПМСО. Українська мова та література. Спеціалізація: редагування освітніх видань':'7.010103 ПМСО. Українська мова та література. Спеціалізація: редагування освітніх видань',
		'7.010103 ПМСО. Українська мова та література. Спеціалізація: польська мова':'7.010103 ПМСО. Українська мова та література. Спеціалізація: польська мова',
		'7.010103 ПМСО. Українська мова та література. Спеціалізація: шкільне бібліотекознавство':'7.010103 ПМСО. Українська мова та література. Спеціалізація: шкільне бібліотекознавство'
		},

	'7.030203 Видавнича справа та редагування':{
      	'7.030203 Видавнича справа та редагування':'7.030203 Видавнича справа та редагування'
		},

	'7.050201 Менеджмент організацій':{
      	'7.050201 Менеджмент організацій':'7.050201 Менеджмент організацій'
		},

	'7.040101 Психологія':{		'7.040101 Психологія':'7.040101 Психологія'
		},

 	'7.010105 Соціальна педагогіка':{
      	'7.010105 Соціальна педагогіка. 7.010103 Педагогіка і методика середньої освіти. Історія':'7.010105 Соціальна педагогіка. 7.010103 Педагогіка і методика середньої освіти. Історія',
		'7.010105 Соціальна педагогіка (після скороченого терміну)':'7.010105 Соціальна педагогіка (після скороченого терміну)'
		},

	'7.010107 Практична психологія':{
		'7.010107 Практична психологія. Cпеціалізація: соціальна педагогіка':'7.010107 Практична психологія. Cпеціалізація: соціальна педагогіка'
		},

	'7.010103 ПМСО. Математика':{		'7.010103 ПМСО. Математика':'7.010103 ПМСО. Математика',
      	'7.010103 ПМСО. Математика і фізика':'7.010103 ПМСО. Математика і фізика',
		'7.010103 ПМСО. Математика та основи інформатики':'7.010103 ПМСО. Математика та основи інформатики',
		'7.010103 ПМСО. Математика та основи економіки':'7.010103 ПМСО. Математика та основи економіки'
		},

	'7.010103 ПМСО. Фізика':{
      	'7.010103 ПМСО. Фізика і математика':'7.010103 ПМСО. Фізика і математика',
		'7.010103 ПМСО. Фізика та основи інформатики':'7.010103 ПМСО. Фізика та основи інформатики'
		},

	'7.080201 Інформатика':{
      	'7.080201 Інформатика':'7.080201 Інформатика'
		},

	'7.010103 ПМСО. Фізична культура':{
      	'7.010103 ПМСО. Фізична культура і біологія. Спеціалізація: туристична робота':'7.010103 ПМСО. Фізична культура і біологія. Спеціалізація: туристична робота',
		'7.010103 ПМСО. Фізична культура. Спеціалізація: географія та краєзнавчо-туристична робота':'7.010103 ПМСО. Фізична культура. Спеціалізація: географія та краєзнавчо-туристична робота',
		'7.010103 ПМСО. Фізична культура. Спеціалізація: методика-спортивно масової роботи, туристична робота':'7.010103 ПМСО. Фізична культура. Спеціалізація: методика-спортивно масової роботи, туристична робота',
		'7.010103 ПМСО. Фізична культура. (після скороченого терміну)':'7.010103 ПМСО. Фізична культура. (після скороченого терміну)'
		},

};

// Включаем синхронизацию связанных списков
syncList1.sync("faculty","training","speciality","specialization");
</script>